/*==================================*/
/* インクルード						*/
/*==================================*/
#include "iodefine.h"				// レジスタ定義ファイル
#include "AdcLib.h"					// A/D変換ライブラリ

/*==================================*/
/* シンボル定義						*/
/*==================================*/

/*==================================*/
/* プロトタイプ宣言					*/
/*==================================*/

/*==================================*/
/* グローバル変数宣言				*/
/*==================================*/
static unsigned int ADC12[8];

/********************************************************************/
/* 12bitA/D変換初期化関数											*/
/* 戻り値：なし														*/
/* 引　数：なし														*/
/********************************************************************/
void InitAdc(void)
{
	// A/D変換端子を入力端子に設定
	PORT4.DR.BYTE = 0x00;
	PORT4.DDR.BYTE = 0x00;

	// 12bitADCの設定
	MSTP(S12AD) = 0;				// 12bitADCの消費電力低減機能の解除
	S12AD.ADCSR.BIT.EXTRG = 0;		// トリガをADTRG0#によるスキャン開始に設定
	S12AD.ADCSR.BIT.CKS = 0;		// PCLK/8
	S12AD.ADCSR.BIT.ADIE = 1;		// S12ADI0割り込み許可
	S12AD.ADCSR.BIT.ADCS = 1;		// 連続スキャンモード
	S12AD.ADCSR.BIT.ADST = 0;		// 12bitADC停止
	S12AD.ADANS.WORD = 0xff;		// AN0-7をADC端子に設定
	S12AD.ADADS.WORD = 0x00;		// A/D変換値加算モード非設定
	S12AD.ADCER.BIT.ACE = 1;		// A/Dデータレジスタ読み出しによる自動クリア
	S12AD.ADCER.BIT.ADRFMT = 0;		// フォーマットを右詰めに設定
	S12AD.ADCSR.BIT.ADST = 1;		// 12bitADC開始
	IPR(S12AD, ADI) = 6;			// 割り込みレベル6
	IEN(S12AD, ADI) = 1;			// 割り込み許可
}

/********************************************************************/
/* 12bit A/D変換 割り込み処理										*/
/********************************************************************/
#pragma interrupt Excep_S12AD_ADI(vect=102)
void Excep_S12AD_ADI(void)
{
	ADC12[AN0] = S12AD.ADDR0;
	ADC12[AN1] = S12AD.ADDR1;
	ADC12[AN2] = S12AD.ADDR2;
	ADC12[AN3] = S12AD.ADDR3;
	ADC12[AN4] = S12AD.ADDR4;
	ADC12[AN5] = S12AD.ADDR5;
	ADC12[AN6] = S12AD.ADDR6;
	ADC12[AN7] = S12AD.ADDR7;
}

/********************************************************************/
/* 12bitA/D変換値取得関数											*/
/* 戻り値：ADC値													*/
/* 引　数：ADC端子番号												*/
/********************************************************************/
unsigned int AdcGet(unsigned char Pin)
{
	return ADC12[Pin];
}

/********************************************************************/
/* end of file														*/
/********************************************************************/
