/*==================================*/
/* インクルード						*/
/*==================================*/
#include "iodefine.h"				// レジスタ定義ファイル
#include "EncoderLib.h"				// エンコーダーライブラリ

/*==================================*/
/* シンボル定義						*/
/*==================================*/

/*==================================*/
/* プロトタイプ宣言					*/
/*==================================*/

/*==================================*/
/* グローバル変数宣言				*/
/*==================================*/

/********************************************************************/
/* エンコーダ1端子の初期化設定										*/
/* 戻り値：なし														*/
/* 引　数：なし														*/
/********************************************************************/
void InitEncoder1(void)
{
	// エンコーダ端子設定
	IOPORT.PFCMTU.BIT.TCLKS = 1;
	
	// 入出力設定
	PORTC.DDR.BIT.B6 = 0;
	PORTC.DDR.BIT.B7 = 0;
	PORTC.ICR.BIT.B6 = 1;
	PORTC.ICR.BIT.B7 = 1;
	
	// MTU1の位相計数モード設定
	MSTP(MTU1) = 0;					// MTU1の消費電力低減機能の解除
	MTU1.TMDR.BIT.MD = 4;			// MTU1を位相計数モード1に設定
	MTUA.TSTR.BIT.CST1 = 1;			// MTU1:カウント開始
	MTU1.TCNT = 32768;
}

/********************************************************************/
/* エンコーダ2端子の初期化設定										*/
/* 戻り値：なし														*/
/* 引　数：なし														*/
/********************************************************************/
void InitEncoder2(void)
{
	// エンコーダ端子設定
	IOPORT.PFCMTU.BIT.TCLKS = 1;
	
	// 入出力設定
	PORTC.DDR.BIT.B4 = 0;
	PORTC.DDR.BIT.B5 = 0;
	PORTC.ICR.BIT.B4 = 1;
	PORTC.ICR.BIT.B5 = 1;
	
	// MTU2の位相計数モード設定
	MSTP(MTU2) = 0;					// MTU2の消費電力低減機能の解除
	MTU2.TMDR.BIT.MD = 4;;			// MTU2を位相計数モード1に設定
	MTUA.TSTR.BIT.CST2 = 1;			// MTU2:カウント開始
	MTU2.TCNT = 32768;
}

/********************************************************************/
/* エンコーダ3端子の初期化設定										*/
/* 戻り値：なし														*/
/* 引　数：なし														*/
/********************************************************************/
void InitEncoder3(void)
{
	// エンコーダ端子設定
	IOPORT.PFDMTU.BIT.TCLKS = 0;
	
	// 入出力設定
	PORTC.DDR.BIT.B2 = 0;
	PORTC.DDR.BIT.B3 = 0;
	PORTC.ICR.BIT.B2 = 1;
	PORTC.ICR.BIT.B3 = 1;
	
	// MTU7の位相計数モード設定
	MSTP(MTU7) = 0;					// MTU7の消費電力低減機能の解除
	MTU7.TMDR.BIT.MD = 4;			// MTU7を位相計数モード1に設定
	MTUB.TSTR.BIT.CST1 = 1;			// MTU7:カウント開始
	MTU7.TCNT = 32768;
}

/********************************************************************/
/* エンコーダ4端子の初期化設定										*/
/* 戻り値：なし														*/
/* 引　数：なし														*/
/********************************************************************/
void InitEncoder4(void)
{
	// エンコーダ端子
	IOPORT.PFDMTU.BIT.TCLKS = 0;
	
	// 入出力設定
	PORTC.DDR.BIT.B0 = 0;
	PORTC.DDR.BIT.B1 = 0;
	PORTC.ICR.BIT.B0 = 1;
	PORTC.ICR.BIT.B1 = 1;
	
	// MTU8の位相計数モード設定
	MSTP(MTU8) = 0;					// MTU8の消費電力低減機能の解除
	MTU8.TMDR.BIT.MD = 4;			// MTU8を位相計数モード1に設定
	MTUB.TSTR.BIT.CST2 = 1;			// MTU8:カウント開始
	MTU8.TCNT = 32768;
}

/********************************************************************/
/* エンコーダ1エンコード値取得関数									*/
/* 戻り値：なし														*/
/* 引　数：エンコード値												*/
/********************************************************************/
short Encode1(void)
{
	short Ret;
	
	Ret = MTU1.TCNT - 32768;
	MTU1.TCNT = 32768;
	
	return Ret;
}

/********************************************************************/
/* エンコーダ2エンコード値取得関数									*/
/* 戻り値：なし														*/
/* 引　数：エンコード値												*/
/********************************************************************/
short Encode2(void)
{
	short Ret;
	
	Ret = MTU2.TCNT - 32768;
	MTU2.TCNT = 32768;
	
	return Ret;
}

/********************************************************************/
/* エンコーダ3エンコード値取得関数									*/
/* 戻り値：なし														*/
/* 引　数：エンコード値												*/
/********************************************************************/
short Encode3(void)
{
	short Ret;
	
	Ret = MTU7.TCNT - 32768;
	MTU7.TCNT = 32768;
	
	return Ret;
}

/********************************************************************/
/* エンコーダ4エンコード値取得関数									*/
/* 戻り値：なし														*/
/* 引　数：エンコード値												*/
/********************************************************************/
short Encode4(void)
{
	short Ret;
	
	Ret = MTU8.TCNT - 32768;
	MTU8.TCNT = 32768;
	
	return Ret;
}

/********************************************************************/
/* end of file														*/
/********************************************************************/
