/*==================================*/
/* インクルード						*/
/*==================================*/
#include "iodefine.h"
#include "TimerLib.h"

/*==================================*/
/* シンボル定義						*/
/*==================================*/
// 定数宣言
#define CMT1_CYCLE 600

/*==================================*/
/* プロトタイプ宣言					*/
/*==================================*/

/*==================================*/
/* グローバル変数宣言				*/
/*==================================*/
static unsigned long TimerCnt;

/********************************************************************/
/* タイマー機能初期化関数											*/
/* 戻り値：なし														*/
/* 引　数：なし														*/
/********************************************************************/
void InitTimer(void)
{
	// 割り込み周期 = 1 / PCLK * CMT_CYCLE
	MSTP(CMT1) = 0;					// CMT1の消費電力低減機能の解除
	CMT1.CMCR.BIT.CMIE = 1;			// CMT1割り込み許可
	CMT1.CMCR.BIT.CKS = 0;			// PCLK/8
	CMT1.CMCOR = CMT1_CYCLE - 1;	// CMT1割り込み周期設定
	IPR(CMT1, CMI1) = 14;			// CMT1割込み優先レベル14
	IEN(CMT1, CMI1) = 1;			// CMT1割り込み許可
	CMT.CMSTR0.BIT.STR1 = 1;		// CMT1カウント開始
}

/********************************************************************/
/* コンベアマッチタイマ1 割り込み処理								*/
/********************************************************************/
#pragma interrupt intCMT1_CMI1(vect=29)
void intCMT1_CMI1(void)
{
	TimerCnt++;
}

/********************************************************************/
/* タイマー関数														*/
/* 戻り値：なし														*/
/* 引　数：待機時間[1ms]											*/
/********************************************************************/
void Timer1(unsigned long TimerSet)
{
	TimerCnt = 0;
	while (TimerCnt<TimerSet * 10);
}

/********************************************************************/
/* タイマー関数														*/
/* 戻り値：なし														*/
/* 引　数：待機時間[0.1ms]											*/
/********************************************************************/
void Timer01(unsigned long TimerSet)
{
	TimerCnt = 0;
	while (TimerCnt<TimerSet);
}

/********************************************************************/
/* end of file														*/
/********************************************************************/
